syllabus/main.tex
% Created 2025-05-25 Sun 15:07
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{geometry}
\geometry{margin=2cm}
\author{Mr. Maxwell}
\date{\today}
\title{Course Syllabus}
\hypersetup{
 pdfauthor={Mr. Maxwell},
 pdftitle={Course Syllabus},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 30.1 (Org mode 9.7.11)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\section{Course Information}
\label{sec:org2c5f558}
\begin{tabular}{ll}
\textbf{course:} & Chemistry AB\\
\textbf{prerequisite:} & Algebra 1 AB\\
\textbf{corequisite:} & Geometry AB\\
\end{tabular}
\section{Instructor Information}
\label{sec:org696f345}
\begin{tabular}{ll}
\textbf{name:} & Mr. Maxwell\\
\textbf{email:} & tyler.maxwell@lausd.net\\
\textbf{room:} & 305E\\
\textbf{office hours:} & By appointment\\
\end{tabular}
\section{Course Description}
\label{sec:org9b8b478}
Chemistry AB is a laboratory-based college-preparatory course. Laboratory experiments provide the empirical basis for understanding and confirming concepts. This course emphasizes discussions, activities, and laboratory exercises, which promote the understanding of the behavior of matter at the macroscopic and the molecular-atomic levels. Chemical principles are introduced so that students will be able to explain the composition and chemical behavior of their world. Chemistry AB lays the foundation for further studies in Chemistry and also serves as an Advanced Placement Chemistry readiness course. 

\textbf{Chemistry AB meets the Grades 9-12 District physical science requirement. Students must complete one physical and one life science requirement. This course meets one year of the University of California 'd' entrance requirement for laboratory science.}
\section{Textbooks and Materials}
\label{sec:org45842bd}

\section{Classroom Expectations/Norms}
\label{sec:orgb650d08}

\section{Classroom Proceedures}
\label{sec:orga944dd2}

\section{Course Objectives}
\label{sec:orgc0411cb}

\subsection{The Periodic Table}
\label{sec:org21fed72}
\begin{itemize}
\item Students know how to use the periodic table to identify:
\begin{itemize}
\item metals, semimetals, nonmetals, and halogens.
\item the lanthanide, actinide, and transactinide elements\footnote{know that the transuranium elements were synthesized and identified in laboratory experiments through the use of nuclear accelerators.}
\item alkali metals, alkaline earth metals and transition metals, trends in ionization energy, electronegativity, and the relative sizes of ions and atoms.
\end{itemize}
\end{itemize}
\subsection{Atomic Structure}
\label{sec:orgb1ba93c}
\begin{itemize}
\item Students know the experimental basis for:
\begin{itemize}
\item Thomson's discovery of the electron,
\item Rutherford's nuclear atom,
\item Millikan's oil drop experiment, and
\item Einstein's explanation of the photoelectric effect.
\item the development of the quantum theory of atomic structure
\item the historical importance of the Bohr model of the atom.
\end{itemize}
\item Students know that spectral lines are the result of transitions of electrons between energy levels and that these lines correspond to photons with a frequency related to the energy spacing between levels by using Planck's relationship (\(E = hv\)).
\item Students know the nucleus of the atom is much smaller than the atom yet contains most of its mass
\end{itemize}
\subsection{Peroidicity and Electron Arrangement}
\label{sec:org1ebd6b8}
\begin{itemize}
\item Students know how to relate the position of an element in the periodic table to its atomic number and atomic mass.
\item Students know how to relate the position of an element in the periodic table to its quantum electron configuration and to its reactivity with other elements in the table.
\item Students know how to use the periodic table to determine the number of electrons available for bonding.
\end{itemize}
\subsection{Chemical Bonding}
\label{sec:org80a6f5e}
\begin{itemize}
\item Students know how to draw Lewis dot structures.
\item Students know atoms combine to form molecules by sharing electrons to form covalent or metallic bonds or by exchanging electrons to form ionic bonds.
\item Students know how to use the periodic table to identify alkali metals, alkaline earth metals and transition metals, trends in ionization energy, electronegativity, and the relative sizes of ions and atoms.
\item Students know chemical bonds between atoms in molecules such as H\textsubscript{2}, CH\textsubscript{4}, NH\textsubscript{3}, H\textsubscript{2}, CCH\textsubscript{2}, N\textsubscript{2}, Cl\textsubscript{2}, and many large biological molecules are covalent.
\end{itemize}
\subsection{The Mole Concept}
\label{sec:orgce3e0d0}
\begin{itemize}
\item Students know the quantity one mole is set by defining one mole of carbon 12 atoms to have a mass of exactly 12 grams.
\item Students know one mole equals \(6.02 \times 10^{23}\) particles (atoms or molecules).
\item Students know how to describe chemical reactions by writing balanced equations.
\end{itemize}
\subsection{Stoichiometry}
\label{sec:org980ed96}
\begin{itemize}
\item Students know how to determine the molar mass of a molecule from its chemical formula and a table of atomic masses and how to convert the mass of a molecular substance to moles, number of particles, or volume of gas at standard temperature and pressure.
\item Students know how to calculate the masses of reactants and products in a chemical reaction from the mass of one of the reactants or products and the relevant atomic masses.
\item Students know how to calculate percent yield in a chemical reaction.
\item Students know how to identify reactions that involve oxidation and reduction and how to balance oxidation-reduction reactions.
\end{itemize}
\subsection{Kinetic Motion of Gases}
\label{sec:org3195bbe}
\begin{itemize}
\item Students know the random motion of molecules and their collisions with a surface create the observable pressure on that surface.
\item Students know the random motion of molecules explains the diffusion of gases.
\item Students know how to convert between the Celsius and Kelvin temperature scales.
\item Students know there is no temperature lower than 0 Kelvin.
\item Students know the kinetic theory of gases relates the absolute temperature of a gas to the average kinetic energy of its molecules or atoms.
\end{itemize}
\subsection{The Gas Laws}
\label{sec:org3315ce2}
\begin{itemize}
\item Students know how to apply the gas laws to relations between the pressure, temperature, and volume of any amount of an ideal gas or any mixture of ideal gases.
\item Students know how to determine the molar mass of a molecule from its chemical formula and a table of atomic masses and how to convert the mass of a molecular substance to moles, number of particles, or volume of gas at standard temperature and pressure.
\item Students know the values and meanings of standard temperature and pressure (STP).
\item Students know how to solve problems by using the ideal gas law in the form \(PV = nRT\).
\item Students know how to apply Dalton's law of partial pressures to describe the composition of gases and Graham's law to predict diffusion of gases.
\end{itemize}
\subsection{Solutions}
\label{sec:orgc674cd6}
\begin{itemize}
\item Students know the definitions of \textbf{solute} and \textbf{solvent}.
\item Students know how to describe the dissolving process at the molecular level by using the concept of random molecular motion.
\item Students know how to calculate the concentration of a solute in terms of grams per liter, molarity, parts per million, and percent composition.
\item Students know the relationship between the molality of a solute in a solution and the solution's depressed freezing point or elevated boiling point.
\item Students know how molecules in a solution are separated or purified by the methods of chromatography and distillation.
\end{itemize}
\subsection{Chemical Equilibrium}
\label{sec:orgcbfdd6d}
\begin{itemize}
\item Students know how to use Le Chatelier's principle to predict the effect of changes in concentration, temperature, and pressure.
\item Students know equilibrium is established when forward and reverse reaction rates are equal.
\item Students know temperature, pressure, and surface area affect the dissolving process.
\item Students know how to write and calculate an equilibrium constant expression for a reaction.
\end{itemize}
\subsection{Acids and Bases}
\label{sec:org429bce6}
\begin{itemize}
\item Students know the observable properties of acids, bases, and salt solutions.
\item Students know acids are hydrogen-ion-donating and bases are hydrogen-ion-accepting substances.
\item Students know the Arrhenius, Brønsted-Lowry, and Lewis acid-base definitions.
\end{itemize}
\subsection{Acid/Base equilibrium}
\label{sec:org72a04a5}
\begin{itemize}
\item Students know acids are hydrogen-ion-donating and bases are hydrogen-ion-accepting substances.
\item Students know strong acids and bases fully dissociate and weak acids and bases partially dissociate.
\item Students know how to use Le Chatelier's principle to predict the effect of changes in concentration, temperature, and pressure.
\item Students know equilibrium is established when forward and reverse reaction rates are equal.
\item Students know how to write and calculate an equilibrium constant expression for a reaction.
\item Students know how to calculate pH from the hydrogen-ion concentration.
\item Students know buffers stabilize pH in acid-base reactions.
\end{itemize}
\subsection{Chemical Thermodynamics}
\label{sec:org8ccbccf}
\begin{itemize}
\item Students know how to describe temperature and heat flow in terms of the motion of molecules (or atoms).
\item Students know energy is released when a material condenses or freezes and is absorbed when a material evaporates or melts.
\item Students know how to solve problems involving heat flow and temperature changes, using known values of specific heat and latent heat of phase change.
\item Students know chemical processes can either release (exothermic) or absorb (endothermic) thermal energy.
\item Students know how to apply Hess's law to calculate enthalpy change in a reaction.
\item Students know how to use the Gibbs free energy equation to determine whether a reaction would be spontaneous.
\item Students know the rate of reaction is the decrease in concentration of reactants or the increase in concentration of products with time.
\item Students know how reaction rates depend on such factors as concentration, temperature, and pressure.
\item Students know the definition and role of activation energy in a chemical reaction.
\item Students know the role a catalyst plays in increasing the reaction rate.
\end{itemize}
\subsection{Organic Chemistry}
\label{sec:org4b04e4f}
\begin{itemize}
\item Students know the bonding characteristics of carbon that result in the formation of a large variety of structures ranging from simple hydrocarbons to complex polymers and biological molecules.
\item Students know the system for naming the ten simplest linear hydrocarbons and isomers that contain single bonds, simple hydrocarbons with double and triple bonds, and simple molecules that contain a benzene ring.
\item Students know how to identify the functional groups that form the basis of alcohols, ketones, ethers, amines, esters, aldehydes, and organic acids.
\item Students know large molecules (polymers), such as proteins, nucleic acids, and starch, are formed by repetitive combinations of simple subunits.
\item Students know amino acids are the building blocks of proteins.
\item Students know the R-group structure of amino acids and know how they combine to form the polypeptide backbone structure of proteins.
\end{itemize}
\subsection{Nuclear Chemistry}
\label{sec:org5376ae3}
\begin{itemize}
\item Students know protons and neutrons in the nucleus are held together by nuclear forces that overcome the electromagnetic repulsion between the protons.
\item Students know some naturally occurring isotopes of elements are radioactive, as are isotopes formed in nuclear reactions.
\item Students know the three most common forms of radioactive decay (alpha, beta, and gamma) and know how the nucleus changes in each type of decay.
\item Students know alpha, beta, and gamma radiation produce different amounts and kinds of damage in matter and have different penetrations.
\item Students know how to calculate the amount of a radioactive substance remaining after an integral number of half-lives have passed.
\end{itemize}
\subsection{Nuclear Energy}
\label{sec:org6f2db0e}
\begin{itemize}
\item Students know the energy release per gram of material is much larger in nuclear fusion or fission reactions than in chemical reactions. The change in mass (calculated by \(E = mc^2\) ) is small but significant in nuclear reactions.
\end{itemize}
\subsection{Particle Physics}
\label{sec:org25739da}
\begin{itemize}
\item Students know protons and neutrons have substructures and consist of particles called quarks.
\end{itemize}
\section{Grading Policy}
\label{sec:org6c2fa0b}
\end{document}
